{
  "publication_id": "tc_20250802_170121_1",
  "session_id": "20250802_170121",
  "original_article": {
    "title": "Creative leverage solves the impermanent loss problem — Curve founder",
    "summary": "Vince Quill 5 minutes ago Creative leverage solves the impermanent loss problem — Curve founder Impermanent loss has been a major factor preventing crypto holders from becoming liquidity providers on decentralized finance platforms. Listen 0:00 44 News COINTELEGRAPH IN YOUR SOCIAL FEEDYield Basis, a protocol developed by the decentralized finance (DeFi) platform Curve Finance, mitigates impermanent loss for tokenized Bitcoin (BTC) and Ether (ETH) liquidity providers (LPs), while also creating a market-based approach to token inflation and emissions, according to Curve founder Dr. Impermanent loss in crypto occurs when the price of assets deposited in a liquidity pool dips or deviates in a way that leaves the user with fewer funds than if they had simply held their crypto and not engaged in liquidity provisioning.",
    "source": "cointelegraph.com",
    "link": "https://cointelegraph.com/news/creative-leverage-solves-impermanent-loss-curve?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "published": "2025-08-02T20:55:29.000Z",
    "crypto_relevance": 0.85,
    "content": "Vince Quill 5 minutes ago Creative leverage solves the impermanent loss problem — Curve founder Impermanent loss has been a major factor preventing crypto holders from becoming liquidity providers on decentralized finance platforms. Listen 0:00 44 News COINTELEGRAPH IN YOUR SOCIAL FEEDYield Basis, a protocol developed by the decentralized finance (DeFi) platform Curve Finance, mitigates impermanent loss for tokenized Bitcoin (BTC) and Ether (ETH) liquidity providers (LPs), while also creating a ...",
    "word_count": 456,
    "key_topics": [
      "Bitcoin",
      "Ethereum",
      "DeFi",
      "Regulation",
      "Trading"
    ],
    "sentiment": "negative",
    "processing_status": "success",
    "author": ""
  },
  "published_at": "2025-08-02T17:02:46.615587",
  "published_by": "Techronicle Editorial Team",
  "publication_status": "published"
}