{
  "publication_id": "tc_20250802_103420_1",
  "session_id": "20250802_103420",
  "original_article": {
    "title": "Arthur Hayes Dumps Millions in Crypto Amid Bearish Bet on U.S. Tariff Impact",
    "link": "https://www.coindesk.com/markets/2025/08/02/arthur-hayes-dumps-millions-in-crypto-amid-bearish-bet-on-u-s-tariff-impact",
    "summary": "",
    "published": "Sat, 02 Aug 2025 13:33:24 +0000",
    "published_parsed": [
      2025,
      8,
      2,
      13,
      33,
      24,
      5,
      214,
      0
    ],
    "source": "CoinDesk: Bitcoin, Ethereum, Crypto News and Price Data",
    "source_url": "https://www.coindesk.com/arc/outboundfeeds/rss",
    "author": "Francisco Rodrigues",
    "tags": [
      "Markets",
      "BitMEX",
      "Arthur Hayes",
      "Ether",
      "News"
    ],
    "collected_at": "2025-08-02T10:34:23.119154",
    "content": "MarketsShareShare this articleCopy linkX iconX (Twitter)LinkedInFacebookEmailArthur Hayes Dumps Millions in Crypto Amid Bearish Bet on U.S. Tariff ImpactHayes suggested that markets will be impacted by President Trump's tariffs and a weaker-than-expected US jobs report, predicting a bearish scenario for cryptoBy Francisco Rodrigues|Edited by Aoyon Ashraf Aug 2, 2025, 1:33 p.m. What to know: Arthur Hayes sold over $13 million worth of crypto holdings, including ETH, ENA, and PEPE, and moved to accumulate USDC.Hayes suggested that markets will be impacted by President Trump's tariffs and a weaker-than-expected US jobs report, predicting a bearish scenario for crypto, with bitcoin potentially testing $100K and ether revisiting $3,000.The crypto market has dropped over 7.5% in the past week, with bitcoin and ether seeing declines of 3.9% and 6.5%, respectively, amid fading rate cut hopes and escalating tensions between the US and Russia.In this articleENAENA$0.5391◢11.91%PEPEPEPE$0.0₄1030◢3.30%Arthur Hayes, the co-founder of crypto exchange BitMEX, has offloaded more than $13 million worth of crypto holdings, including ether (ETH), ethena ENA$0.5391, and pepe PEPE$0.0₄1030.Data from Arkham Intelligence shows Hayes sold millions worth of these cryptocurrencies and moved to accumulate USDC, with the stablecoin now making up over 80% of the $27.9 million in the address associated with him.STORY CONTINUES BELOWDon't miss another story.Subscribe to the Crypto Daybook Americas Newsletter today. See all newslettersSign me upBy signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy.The address sold 2,373 ETH worth $8.32 million, 7.76 million ENA valued at $4.62 million, and 38.86 billion PEPE for $414,700. In a post on X, he seemingly confirmed he is behind the address and pointed to a bearish scenario for the crypto space.Hayes suggested that markets will take a hit from the impact of President Donald Trump’s tariffs, some of which came into effect on Aug. 1 and others are coming on Aug. 7, which affect key trading partners.Combined with a weaker-than-expected U.S. jobs report, he argued that no major economy is expanding credit fast enough to boost nominal GDP. Against this backdrop, he predicted bitcoin could “test $100K” while ether will revisit $3,000.Y? US Tariff bill coming due in 3q … at least the mrkt believes that after NFP print. No major econ is creating enough credit fast enough to boost nominal gdp. So $BTC tests $100k, $ETH tests $3k. Come see my @WebX_Asia Tokyo keynote Aug 25 for more info. Back to the beach. https://t.co/zuHlwgQKC7— Arthur Hayes (@CryptoHayes) August 2, 2025 The crypto market, as measured by the CoinDesk 20 (CD20) index, lost more than 7.5% of its value over the past week as rate cut hopes faded. Bitcoin outperformed the wider market with a 3.9% drop, and is now standing at $113,500.Similarly, Ether saw a 6.5% drop in the same period and now trades at $3,500. While rate cut hopes dimmed on Friday, later in the session they surged after the labor market showed signs of weakness. Polymarket traders are now weighing a 70% chance of a rate cut in September.The market is also dropping as tensions between the U.S. and Russia escalate. After former Russian President Dmitry Medvedev threatened the U.S. in response to an ultimatum on Moscow to agree to a cease-fire, Trump said he ordered two nuclear submarines to move to the “appropriate regions.”Despite the sell-off, Hayes may remain bullish. In a post last month, he said his year-end target for the price of bitcoin was $250,000, while he saw ether rise to $10,000.BitMEXArthur HayesEtherFrancisco RodriguesFrancisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold.X iconLatest Crypto News Crypto Market Bloodbath: Three Reasons Traders Are in Risk-Off Mode1 hour agoWall Street Is Buying Crypto ‘Quietly’ — And That’s Bullish, Says Bitmine's Tom Lee4 hours agoCrypto Carnage Continues Even as Gold, Bonds Surge on Soft U.S. Jobs Data20 hours agoCrypto ETFs See Record $12.8B Inflows in July as Market Rallies to New Highs20 hours agoWhat Bitcoin's Velocity Says About Its Future20 hours agoRed Coin, Blue Coin: The New Politics of Exposure20 hours agoTop StoriesBitcoin, Ether Start August on a Shaky Note as Dollar Index Tops 100; Yen Hits 4-Month Low Ahead of Nonfarm PayrollsAug 1, 2025Wall Street Is Buying Crypto ‘Quietly’ — And That’s Bullish, Says Bitmine's Tom Lee4 hours agoCrypto ETFs See Record $12.8B Inflows in July as Market Rallies to New Highs20 hours agoU.S. Added Just 73K Jobs in July, Unemployment Rate Rose to 4.2%Aug 1, 2025Gemini's Tyler Winklevoss Says Trump CFTC Pick Quintenz Has 'Disqualifying' Views22 hours agoEthena's USDe Outpaces BlackRock’s Bitcoin, Ether ETFs With $3.1B Inflow SurgeAug 1, 2025In this articleENAENA$0.5391◢11.91%PEPEPEPE$0.0₄1030◢3.30%",
    "word_count": 783,
    "crypto_relevance": 0.6666666666666666
  },
  "published_at": "2025-08-02T10:34:58.273973",
  "published_by": "Techronicle Editorial Team",
  "publication_status": "published",
  "editorial_process": {
    "collected_by": "Gary",
    "analyzed_by": "Aravind",
    "fact_checked_by": "Tijana",
    "approved_by": "Jerin",
    "published_by": "James"
  }
}